{"pages":[{"title":"","text":"How did Apollo evolve?Architecture, to get start withCore of Apollo is a ubuntu OS, kernel is Linux kernel 4.4.32 with PREEMPT_RT patch option turned on, making it a realtime kernel. Also the team added some driver and security patches to add hardware compatability and Security patches. Upon the kernel there is a runtime platform, a customized version of Robot Operating System (ROS). Although its named a “OS”, the ROS is not a OS but a collection of more than 3000 robot related libraries and softwares. Upon the original, Apollo team did the following optimizations: Shared memory The sensor components collect the data and send it to shared memory so downstream processing modules can avoid copying the data. They can directly access the memory. Decentralization ROS out of box provides functionality that all peripheral units serve as nodes controlled by ROS master node. May cause severe damage if master node fails. Apollo pulls all nodes in a common domain, replacing the master node. Each node uses Real-Time Publish-Subscribe (RTPS) protocol to implement P2P (node to node) topology. Data compatability ROS Message Interface language format enforces a common format of all nodes in order for nodes to understand each other Apollo used Protobuf protocal for communication between nodes. Adding new field will not break backward compatibility. Overall, the system is a pub-sub architecture built upon a layered operating system and runtime environment. in the macro point of view. Sensor modules serves as data publishers and data processing modules, which enables automation of driving, as subscribers. The tweaked linux kernel and ROS runtime supports the implementation of the components above. References: HOWTO setup Linux with PREEMPT_RT properly Apollo Kernel README Analysis of Baidu Apollo autonomous driving platform Functional ImprovementsIn the very first release of Apollo open platform, the functionality of the system was minimal. The only function it provided was Automatic GPS Way-point Following. At this stage of development, Apollo 1.0 cannot perceive obstacles in close proximity, drive on public roads, or drive in areas without GPS signals. It was a barebone system with simple functionality as a technical identification. with 3 components above runtime frame work layer: Localization (positioning), Control and Human Machine Interface (HMI). In the next release 1.5, more components were added. Map Engine API was added, preparing for the simple city road scenario for next release. Basic Perception, Prediction and Planning components was added but first enabled with a series of AI algorithms in 2.0 release. In 3.0, a Deep Learning based End-to-End component was added to the platform. In 5.0, a Vehicle to Everything (V2X) adapter was added. As of now in 7.0, the main responsibilities of components didn’t experience major changes, each components was reinforced either by new AI algorithms or data pipeline improvements within the range of each component. Benefited from the Implicit Invocation Style, the components are loosely-coupled. Even though there’s many major changes in the algorithms in Perception, Prediction, Planning and E2E components, the cooperation between them and control component was not hard to maintain since the only thing need to be as original is the data exchange format (solved by Protobuf, as we mentioned before). Also this style has brought easier debugging experience for such a big autonomous car system, errors can be limited within components and discovered by the components’ abnormal behavior in test operations.","link":"/Apollo-Architecture-And-Evolve.html"},{"title":"","text":"Our Team Guo Xiaoyao Email: 19xg1@queensu.ca Name: Email: 19xg1@queensu.ca Name: Mengyang Liu Email: 19ml49@queensu.ca Name: Mackenzie Tummers Email: 8mct1@queensu.ca Name: Manqi Yang Email: 18my26@queensu.ca Name: Nuoyan Yang Email: 18ny12@queensu.ca Name: Zhiqing Zhang Email: 18zz119@queensu.ca","link":"/about/about.html"},{"title":"","text":".bb1{ float: right; width: 200px; height: 110px; margin-top: 80px; margin-right: 40px; -webkit-transition: transform .30s linear; -moz-transition: transform .30s linear; -o-transition: transform .30s linear; transition: transform .30s linear; } .photo:hover{ transform:rotate(360deg); } .photo img{ clip-path: circle(40% at 50% 50%); -webkit-clip-path:circle(40% at 50% 50%); transition: all 400ms ease; cursor: pointer; } .photo img:hover{ clip-path: circle(75% at 50% 50%); -webkit-clip-path:circle(75% at 50% 50%); }","link":"/about/aboutUs.css"},{"title":"","text":"Our Team Name: Xiaoyao Guo Email: 19xg1@queensu.ca Name: Mengyang Liu Email: 19ml49@queensu.ca Name: Mackenzie Tummers Email: 8mct1@queensu.ca Name: Manqi Yang Email: 18my26@queensu.ca Name: Nuoyan Yang Email: 18ny12@queensu.ca Name: Zhiqing Zhang Email: 18zz119@queensu.ca","link":"/about/aboutUs.html"},{"title":"","text":".single-member{ width: 280px; float: left; font-family: sans-sarif; margin: 30px 2.5%; background-color: #fff; text-align: center; position: relative; } .member-image img{ max-width: 100%; vertical-align: middle; } h3 { font-size: 24px; font-weight: normal; margin: 10px 0 0; text-transform: uppercase; } h5 { font-size: 16px; font-weight: 300; margin: 0 0 15px; line-height: 22px; } p {font-size: 14px; font-weight: 300; line-height: 22px; padding: 0 30px; margin-bottom: 10px; } .social-touch a{ display: inline-block; width: 27px; height: 26px; vertical-align: middle; margin: 0 2px; background-image: url(images/social-icons.png); background-repeat: no-repeat; opacity: 0.7; transition: 0.3s; } .social-touch a:hover{ opacity: 1; transition: 0.3s; } .fb-touch{ background-position: 0 0; } .tweet-touch{ background-position: -35px 0; } .linkedin-touch{ background-position: -71px 0; } .icon-colored .fb-touch{ background-position: 0 -27px; } .icon-colored .tweet-touch{ background-position: -35px -27px; } .icon-colored .linkedin-touch{ background-position: -71px -27px; } .effect-3{ max-height: 302px; min-height: 302px; overflow: hidden; } .effect-3 h3{ padding-top: 7px; line-height: 33px; } .effect-3 .member-image{ border-bottom: 5px solid #e5642b; transition: 0.4s; height: 212px; width: 100%; display: inline-block; float: none; vertical-align: middle; } .effect-3 .member-info{ transition: 0.4s; } .effect-3 .member-image img{ width: 100%; vertical-align: bottom; } .effect-3 .social-touch{ background-color: #e5642b; float: left; left: 0; bottom: 0; overflow: hidden; padding: 5px 0; width: 100%; transition: 0.4s; } .effect-3:hover .member-image{ border-bottom: 0; border-radius: 0 0 50px 50px; height: 81px; display: inline-block; overflow: hidden; width: 109px; transition: 0.4s; }","link":"/about/card.css"}],"posts":[{"title":"WELCOME TO THE APOLLO PROJECT","text":"Imagine. A morning commute without the dread of rush-hour traffic. Imagine. Your children playing in total safety with their friends on your neighbourhood’s streets. Imagine. Never getting that late night phone call about that tragic accident out on the road. Autonomous vehicles are this future. Our autonomous vehicle systems are re-imagining the ways in which we use our vehicles and roads so that our communities and families are safe and so that we can spend more time with the ones we love, doing the things we love rather than stuck in congestion twice a day. Apollo is our open, reliable, and comprehensive software platform for autonomous vehicle development shared with partners around the world. Drive with us into the future™. Assignment 1 Link (CONCEPTUAL ARCHITECTURE OF THE APOLLO PLATFORM)Report:https://drive.google.com/file/d/1WJ-M-hBluGuTlkuKcbYqM0XkYV5r9T_S/view?usp=sharing Presentation:https://docs.google.com/presentation/d/1vX66s_2jKwLYytALKSSfMDlTB9DSlz6Q/edit?usp=sharing&amp;ouid=115986065545442787912&amp;rtpof=true&amp;sd=true YouTube URL for Presentation:https://youtu.be/L6nwc1g3N8k Assignment 2 Link (CONCRETE ARCHITECTURE OF THE APOLLO PLATFORM)Report:https://drive.google.com/file/d/1IraVNZ_A1ao1N0PjG6J6bOZAlZ6QLadM/view?usp=sharing Presentation:https://docs.google.com/presentation/d/1B89FomDMDfUp5n1UxvbURF2UxOqJH6DA/edit?usp=sharing&amp;ouid=115986065545442787912&amp;rtpof=true&amp;sd=true YouTube URL for Presentation:https://youtu.be/iJ3ppma-rpQ","link":"/2022/02/01/WELCOME-TO-THE-APOLLO-PROJECT/"}],"tags":[],"categories":[{"name":"welcome","slug":"welcome","link":"/categories/welcome/"}]}